src/InformationRegisters/цур_МетаданныеКонфигурации/цур_МетаданныеКонфигурации.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>цур_МетаданныеКонфигурации</name>
  <resources>
    <name>Синоним</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>200</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>ДанныеJSON</name>
    <type>
      <types>String</types>
    </type>
  </resources>
  <dimensions>
    <name>ИнформационнаяБаза</name>
    <type>
      <types>CatalogRef.цур_ИнформационныеБазы</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ВидМетаданных</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>ИмяОбъекта</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </dimensions>
</mdclass:InformationRegister>

src/Enums/цур_ИсточникиМетаданных/цур_ИсточникиМетаданных.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>цур_ИсточникиМетаданных</name>
  <enumValues>
    <name>ТекущаяКонфигурация</name>
  </enumValues>
  <enumValues>
    <name>ИзКаталогаФайлов</name>
  </enumValues>
  <enumValues>
    <name>ВыгрузитьАвтоматически</name>
  </enumValues>
  <enumValues>
    <name>ИзРегистра</name>
  </enumValues>
  <enumValues>
    <name>ИзРепозитория</name>
  </enumValues>
</mdclass:Enum>

src/CommonModules/цур_ПровайдерМетаданныхСервер/Module.bsl
#Область ПрограммныйИнтерфейс

// Возвращает список объектов метаданных по виду.
// Источник определяется по реквизиту ИсточникМетаданных информационной базы.
//
// Параметры:
//  ИнформационнаяБаза - СправочникСсылка.цур_ИнформационныеБазы
//  ВидМетаданных      - Строка - "Catalog", "Document" и т.д.
//
// Возвращаемое значение:
//  Массив из Структура - каждый элемент: {ИмяОбъекта, Синоним}
//
Функция СписокОбъектовМетаданных(ИнформационнаяБаза, ВидМетаданных) Экспорт

	Если НЕ ЗначениеЗаполнено(ИнформационнаяБаза) Тогда
		Возврат СписокОбъектовИзПлатформы(ВидМетаданных);
	КонецЕсли;

	Реквизиты = цур_ОбщегоНазначения.ЗначенияРеквизитовОбъекта(
		ИнформационнаяБаза,
		"ИсточникМетаданных, КаталогВыгрузкиКонфигурации,
		|АдресБазы, СервернаяБаза, Пользователь, Пароль");

	Источник = Реквизиты.ИсточникМетаданных;
	Если НЕ ЗначениеЗаполнено(Источник) Тогда
		Источник = Перечисления.цур_ИсточникиМетаданных.ТекущаяКонфигурация;
	КонецЕсли;

	Если Источник = Перечисления.цур_ИсточникиМетаданных.ТекущаяКонфигурация Тогда
		Возврат СписокОбъектовИзПлатформы(ВидМетаданных);

	ИначеЕсли Источник = Перечисления.цур_ИсточникиМетаданных.ИзКаталогаФайлов Тогда
		Возврат СписокОбъектовИзКаталога(Реквизиты.КаталогВыгрузкиКонфигурации, ВидМетаданных);

	ИначеЕсли Источник = Перечисления.цур_ИсточникиМетаданных.ВыгрузитьАвтоматически Тогда
		КаталогАвто = ПолучитьИлиВыгрузитьКаталог(ИнформационнаяБаза, Реквизиты);
		Возврат СписокОбъектовИзКаталога(КаталогАвто, ВидМетаданных);

	ИначеЕсли Источник = Перечисления.цур_ИсточникиМетаданных.ИзРегистра Тогда
		Возврат СписокОбъектовИзРегистра(ИнформационнаяБаза, ВидМетаданных);

	ИначеЕсли Источник = Перечисления.цур_ИсточникиМетаданных.ИзРепозитория Тогда
		ВызватьИсключение НСтр("ru = 'Источник метаданных ""Из репозитория"" пока не реализован.'");

	КонецЕсли;

	Возврат Новый Массив;

КонецФункции

// Возвращает структуру объекта (реквизиты, ТЧ, команды, стандартные реквизиты).
// Источник определяется по реквизиту ИсточникМетаданных информационной базы.
//
// Параметры:
//  ИнформационнаяБаза - СправочникСсылка.цур_ИнформационныеБазы
//  ВидМетаданных      - Строка
//  ИмяОбъекта         - Строка
//
// Возвращаемое значение:
//  Структура - ключи: attributes, tabularSections, standardAttributes, commands
//              каждый — Массив из Структура {name, synonym}
//  Неопределено — если объект не найден
//
//BSLLS:LatinAndCyrillicSymbolInWord-off
Функция СтруктураОбъекта(ИнформационнаяБаза, ВидМетаданных, ИмяОбъекта) Экспорт
//BSLLS:LatinAndCyrillicSymbolInWord-on

	Если НЕ ЗначениеЗаполнено(ИнформационнаяБаза) Тогда
		Возврат СтруктураОбъектаИзПлатформы(ВидМетаданных, ИмяОбъекта);
	КонецЕсли;

	Реквизиты = цур_ОбщегоНазначения.ЗначенияРеквизитовОбъекта(
		ИнформационнаяБаза,
		"ИсточникМетаданных, КаталогВыгрузкиКонфигурации,
		|АдресБазы, СервернаяБаза, Пользователь, Пароль");

	Источник = Реквизиты.ИсточникМетаданных;
	Если НЕ ЗначениеЗаполнено(Источник) Тогда
		Источник = Перечисления.цур_ИсточникиМетаданных.ТекущаяКонфигурация;
	КонецЕсли;

	Если Источник = Перечисления.цур_ИсточникиМетаданных.ТекущаяКонфигурация Тогда
		Возврат СтруктураОбъектаИзПлатформы(ВидМетаданных, ИмяОбъекта);

	ИначеЕсли Источник = Перечисления.цур_ИсточникиМетаданных.ИзКаталогаФайлов Тогда
		Возврат СтруктураОбъектаИзКаталога(Реквизиты.КаталогВыгрузкиКонфигурации, ВидМетаданных, ИмяОбъекта);

	ИначеЕсли Источник = Перечисления.цур_ИсточникиМетаданных.ВыгрузитьАвтоматически Тогда
		КаталогАвто = ПолучитьИлиВыгрузитьКаталог(ИнформационнаяБаза, Реквизиты);
		Возврат СтруктураОбъектаИзКаталога(КаталогАвто, ВидМетаданных, ИмяОбъекта);

	ИначеЕсли Источник = Перечисления.цур_ИсточникиМетаданных.ИзРегистра Тогда
		Возврат СтруктураОбъектаИзРегистра(ИнформационнаяБаза, ВидМетаданных, ИмяОбъекта);

	ИначеЕсли Источник = Перечисления.цур_ИсточникиМетаданных.ИзРепозитория Тогда
		ВызватьИсключение НСтр("ru = 'Источник метаданных ""Из репозитория"" пока не реализован.'");

	КонецЕсли;

	Возврат Неопределено;

КонецФункции

// Загружает метаданные ИБ в регистр цур_МетаданныеКонфигурации.
// Выполняет полную замену записей по отбору ИнформационнаяБаза.
//
// Параметры:
//  ИнформационнаяБаза - СправочникСсылка.цур_ИнформационныеБазы
//
Процедура ЗагрузитьМетаданныеИБ(ИнформационнаяБаза) Экспорт

	ВсеВиды = цур_РеестрМетаданныхСерверПовтИсп.ВсеВидыМетаданных();

	НачатьТранзакцию();
	Попытка

		// Удаляем все старые записи по данной ИБ
		НаборЗаписей = РегистрыСведений.цур_МетаданныеКонфигурации.СоздатьНаборЗаписей();
		НаборЗаписей.Отбор.ИнформационнаяБаза.Установить(ИнформационнаяБаза);
		НаборЗаписей.Записать();

		Для Каждого ОписаниеВида Из ВсеВиды Цикл

			Если ПустаяСтрока(ОписаниеВида.ИмяКоллекцииМетаданных) Тогда
				Продолжить;
			КонецЕсли;

			КоллекцияМетаданных = Метаданные[ОписаниеВида.ИмяКоллекцииМетаданных];
			Если КоллекцияМетаданных = Неопределено Тогда
				Продолжить;
			КонецЕсли;

			Для Каждого ОбъектМД Из КоллекцияМетаданных Цикл

				ДанныеJSON = СобратьJSONОбъекта(ОбъектМД);

				НаборЗаписей = РегистрыСведений.цур_МетаданныеКонфигурации.СоздатьНаборЗаписей();
				НаборЗаписей.Отбор.ИнформационнаяБаза.Установить(ИнформационнаяБаза);
				НаборЗаписей.Отбор.ВидМетаданных.Установить(ОписаниеВида.ВидМетаданных);
				НаборЗаписей.Отбор.ИмяОбъекта.Установить(ОбъектМД.Имя);

				НоваяЗапись = НаборЗаписей.Добавить();
				НоваяЗапись.ИнформационнаяБаза = ИнформационнаяБаза;
				НоваяЗапись.ВидМетаданных      = ОписаниеВида.ВидМетаданных;
				НоваяЗапись.ИмяОбъекта         = ОбъектМД.Имя;
				НоваяЗапись.Синоним             = ОбъектМД.Синоним;
				НоваяЗапись.ДанныеJSON          = ДанныеJSON;

				НаборЗаписей.Записать();

			КонецЦикла;

		КонецЦикла;

		ЗафиксироватьТранзакцию();

	Исключение
		ОтменитьТранзакцию();
		ВызватьИсключение;
	КонецПопытки;

КонецПроцедуры

// Загружает метаданные из удалённой информационной базы.
// Выгружает конфигурацию через Designer во временный каталог, парсит XML, записывает в регистр.
//
// Параметры:
//  СсылкаИнформационнойБазы - СправочникСсылка.цур_ИнформационныеБазы
//
// Возвращаемое значение:
//  Структура - результат: Успешно (Булево), Количество (Число), Ошибки (Массив)
//
Функция ЗагрузитьМетаданныеИзБазы(СсылкаИнформационнойБазы) Экспорт

	Результат = Новый Структура("Успешно, Количество, Ошибки", Ложь, 0, Новый Массив);

	РеквизитыБазы = цур_ОбщегоНазначения.ЗначенияРеквизитовОбъекта(
		СсылкаИнформационнойБазы,
		"АдресБазы, Пользователь, Пароль, СервернаяБаза");

	Если РеквизитыБазы = Неопределено Тогда
		Результат.Ошибки.Добавить(НСтр("ru = 'Информационная база не найдена.'"));
		Возврат Результат;
	КонецЕсли;

	// TODO: передать ИнформационнаяБазу из контекста (будет сделано в PR-3)
	ПутьК1cv8 = цур_КонструкторРасширенияСервер.ПутьКПлатформе(СсылкаИнформационнойБазы);

	Если ПустаяСтрока(ПутьК1cv8) Тогда
		Результат.Ошибки.Добавить(НСтр("ru = 'Не удалось определить путь к платформе 1С.'"));
		Возврат Результат;
	КонецЕсли;

	// Временный каталог для выгрузки
	ВременныйКаталог = цур_ФайловыеОперацииСервер.СоздатьВременныйКаталог("цур_мд");

	// Формируем строку подключения
	Если РеквизитыБазы.СервернаяБаза Тогда
		СтрокаИБ = СтрШаблон("/S ""%1""", РеквизитыБазы.АдресБазы);
	Иначе
		СтрокаИБ = СтрШаблон("/F ""%1""", РеквизитыБазы.АдресБазы);
	КонецЕсли;

	// Выгружаем конфигурацию через Designer
	ЧастиКоманды = Новый Массив;
	ЧастиКоманды.Добавить(СтрШаблон("""%1""", ПутьК1cv8));
	ЧастиКоманды.Добавить(СтрШаблон("DESIGNER %1", СтрокаИБ));

	Если ЗначениеЗаполнено(РеквизитыБазы.Пользователь) Тогда
		ЧастиКоманды.Добавить(СтрШаблон("/N""%1""", РеквизитыБазы.Пользователь));
	КонецЕсли;

	Если ЗначениеЗаполнено(РеквизитыБазы.Пароль) Тогда
		ЧастиКоманды.Добавить(СтрШаблон("/P""%1""", РеквизитыБазы.Пароль));
	КонецЕсли;

	ЧастиКоманды.Добавить("/DisableStartupMessages");
	ЧастиКоманды.Добавить("/DisableStartupDialogs");
	ЧастиКоманды.Добавить(СтрШаблон("/DumpConfigToFiles ""%1""", ВременныйКаталог));

	КодВозврата = Неопределено;
	//BSLLS:ExternalAppStarting-off
	ЗапуститьПриложение(СтрСоединить(ЧастиКоманды, " "), , Истина, КодВозврата);
	//BSLLS:ExternalAppStarting-on

	Если КодВозврата = Неопределено Или КодВозврата <> 0 Тогда
		цур_ФайловыеОперацииСервер.УдалитьВременныйКаталог(ВременныйКаталог);
		Результат.Ошибки.Добавить(СтрШаблон(
			НСтр("ru = 'Ошибка выгрузки конфигурации (код %1).'"), КодВозврата));
		Возврат Результат;
	КонецЕсли;

	// Парсим выгруженные файлы
	Результат = ЗагрузитьМетаданныеИзКаталога(СсылкаИнформационнойБазы, ВременныйКаталог);

	// Очистка
	цур_ФайловыеОперацииСервер.УдалитьВременныйКаталог(ВременныйКаталог);

	Возврат Результат;

КонецФункции

// Загружает метаданные из каталога выгрузки конфигурации (DumpConfigToFiles).
// Парсит XML-файлы объектов и записывает в регистр.
//
// Параметры:
//  ИнформационнаяБаза - СправочникСсылка.цур_ИнформационныеБазы
//  КаталогВыгрузки    - Строка - путь к каталогу с выгруженной конфигурацией
//
// Возвращаемое значение:
//  Структура - результат: Успешно (Булево), Количество (Число), Ошибки (Массив)
//
Функция ЗагрузитьМетаданныеИзКаталога(ИнформационнаяБаза, КаталогВыгрузки) Экспорт

	Результат = Новый Структура("Успешно, Количество, Ошибки", Ложь, 0, Новый Массив);

	ВсеВиды = цур_РеестрМетаданныхСерверПовтИсп.ВсеВидыМетаданных();

	НачатьТранзакцию();
	Попытка

		// Удаляем все старые записи по данной ИБ
		НаборОчистки = РегистрыСведений.цур_МетаданныеКонфигурации.СоздатьНаборЗаписей();
		НаборОчистки.Отбор.ИнформационнаяБаза.Установить(ИнформационнаяБаза);
		НаборОчистки.Записать();

		Для Каждого ОписаниеВида Из ВсеВиды Цикл

			ИмяКоллекции = ОписаниеВида.ИмяКоллекцииРасширения;

			Если НЕ ЗначениеЗаполнено(ИмяКоллекции) Тогда
				Продолжить;
			КонецЕсли;

			КаталогКоллекции = КаталогВыгрузки + "/" + ИмяКоллекции;
			ФайлКаталога = Новый Файл(КаталогКоллекции);

			Если НЕ ФайлКаталога.Существует() Тогда
				Продолжить;
			КонецЕсли;

			ФайлыXML = НайтиФайлы(КаталогКоллекции, "*.xml", Ложь);

			Для Каждого ФайлОбъекта Из ФайлыXML Цикл

				ИмяОбъекта = ФайлОбъекта.ИмяБезРасширения;

				Попытка
					ДанныеОбъекта = РазобратьXMLОбъекта(ФайлОбъекта.ПолноеИмя, КаталогКоллекции, ИмяОбъекта);
				Исключение
					Результат.Ошибки.Добавить(СтрШаблон("%1.%2: %3",
						ОписаниеВида.ВидМетаданных, ИмяОбъекта,
						цур_ОбщегоНазначения.ОписаниеОшибкиКраткое(ИнформацияОбОшибке())));
					Продолжить;
				КонецПопытки;

				НаборЗаписей = РегистрыСведений.цур_МетаданныеКонфигурации.СоздатьНаборЗаписей();
				НаборЗаписей.Отбор.ИнформационнаяБаза.Установить(ИнформационнаяБаза);
				НаборЗаписей.Отбор.ВидМетаданных.Установить(ОписаниеВида.ВидМетаданных);
				НаборЗаписей.Отбор.ИмяОбъекта.Установить(ИмяОбъекта);

				НоваяЗапись = НаборЗаписей.Добавить();
				НоваяЗапись.ИнформационнаяБаза = ИнформационнаяБаза;
				НоваяЗапись.ВидМетаданных      = ОписаниеВида.ВидМетаданных;
				НоваяЗапись.ИмяОбъекта         = ИмяОбъекта;
				НоваяЗапись.Синоним             = ДанныеОбъекта.Синоним;
				НоваяЗапись.ДанныеJSON          = ДанныеОбъекта.JSON;

				НаборЗаписей.Записать();
				Результат.Количество = Результат.Количество + 1;

			КонецЦикла;

		КонецЦикла;

		ЗафиксироватьТранзакцию();
		Результат.Успешно = Истина;

	Исключение
		ОтменитьТранзакцию();
		Результат.Ошибки.Добавить(цур_ОбщегоНазначения.ОписаниеОшибкиКраткое(ИнформацияОбОшибке()));
	КонецПопытки;

	Возврат Результат;

КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// Разбирает XML-файл объекта метаданных из выгрузки конфигурации.
// Извлекает синоним из Properties и список дочерних элементов из ChildObjects.
//
// Параметры:
//  ПутьКФайлу     - Строка - полный путь к XML-файлу объекта
//  КаталогКоллекции - Строка - путь к каталогу коллекции
//  ИмяОбъекта     - Строка - имя объекта
//
// Возвращаемое значение:
//  Структура - {Синоним, JSON}
//
Функция РазобратьXMLОбъекта(ПутьКФайлу, КаталогКоллекции, ИмяОбъекта)

	Синоним = ИмяОбъекта;
	Реквизиты = Новый Массив;
	ТабличныеЧасти = Новый Массив;
	Команды = Новый Массив;
	СтандартныеРеквизиты = Новый Массив;

	ЧтениеXML = Новый ЧтениеXML;
	ЧтениеXML.ОткрытьФайл(ПутьКФайлу);

	ВнутриProperties = Ложь;
	ВнутриChildObjects = Ложь;
	ВнутриSynonym = Ложь;

	Пока ЧтениеXML.Прочитать() Цикл

		Если ЧтениеXML.ТипУзла = ТипУзлаXML.НачалоЭлемента Тогда

			Если ЧтениеXML.Имя = "Properties" Тогда
				ВнутриProperties = Истина;

			ИначеЕсли ЧтениеXML.Имя = "ChildObjects" Тогда
				ВнутриChildObjects = Истина;

			ИначеЕсли ВнутриProperties И ЧтениеXML.Имя = "Synonym" Тогда
				ВнутриSynonym = Истина;

			ИначеЕсли ВнутриSynonym И ЧтениеXML.Имя = "v8:content" Тогда
				ЧтениеXML.Прочитать();
				Если ЧтениеXML.ТипУзла = ТипУзлаXML.Текст Тогда
					Синоним = ЧтениеXML.Значение;
				КонецЕсли;

			ИначеЕсли ВнутриChildObjects Тогда

				ИмяТега = ЧтениеXML.Имя;
				ЧтениеXML.Прочитать();

				Если ЧтениеXML.ТипУзла = ТипУзлаXML.Текст Тогда

					ИмяЭлемента = ЧтениеXML.Значение;

					Если ИмяТега = "Attribute" Тогда
						Реквизиты.Добавить(Новый Структура("name, synonym", ИмяЭлемента, ИмяЭлемента));

					ИначеЕсли ИмяТега = "TabularSection" Тогда
						ТабличныеЧасти.Добавить(Новый Структура("name, synonym, attributes",
							ИмяЭлемента, ИмяЭлемента, Новый Массив));

					ИначеЕсли ИмяТега = "Command" Тогда
						Команды.Добавить(Новый Структура("name, synonym", ИмяЭлемента, ИмяЭлемента));

					ИначеЕсли ИмяТега = "StandardAttribute" Тогда
						СтандартныеРеквизиты.Добавить(Новый Структура("name, synonym", ИмяЭлемента, ИмяЭлемента));

					КонецЕсли;

				КонецЕсли;

			КонецЕсли;

		ИначеЕсли ЧтениеXML.ТипУзла = ТипУзлаXML.КонецЭлемента Тогда

			Если ЧтениеXML.Имя = "Properties" Тогда
				ВнутриProperties = Ложь;
			ИначеЕсли ЧтениеXML.Имя = "ChildObjects" Тогда
				ВнутриChildObjects = Ложь;
			ИначеЕсли ЧтениеXML.Имя = "Synonym" Тогда
				ВнутриSynonym = Ложь;
			КонецЕсли;

		КонецЕсли;

	КонецЦикла;

	ЧтениеXML.Закрыть();

	//BSLLS:LatinAndCyrillicSymbolInWord-off
	Данные = Новый Структура;
	Данные.Вставить("attributes",         Реквизиты);
	Данные.Вставить("tabularSections",    ТабличныеЧасти);
	Данные.Вставить("standardAttributes", СтандартныеРеквизиты);
	Данные.Вставить("commands",           Команды);
	//BSLLS:LatinAndCyrillicSymbolInWord-on

	Возврат Новый Структура("Синоним, JSON", Синоним, СериализоватьВJSON(Данные));

КонецФункции

// Возвращает список объектов метаданных из регистра цур_МетаданныеКонфигурации.
//
// Параметры:
//  ИнформационнаяБаза - СправочникСсылка.цур_ИнформационныеБазы
//  ВидМетаданных      - Строка
//
// Возвращаемое значение:
//  Массив из Структура {ИмяОбъекта, Синоним}
//
Функция СписокОбъектовИзРегистра(ИнформационнаяБаза, ВидМетаданных)

	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	Рег.ИмяОбъекта КАК ИмяОбъекта,
	|	Рег.Синоним КАК Синоним
	|ИЗ
	|	РегистрСведений.цур_МетаданныеКонфигурации КАК Рег
	|ГДЕ
	|	Рег.ИнформационнаяБаза = &ИнформационнаяБаза
	|	И Рег.ВидМетаданных = &ВидМетаданных
	|УПОРЯДОЧИТЬ ПО
	|	Рег.ИмяОбъекта ВОЗР";

	Запрос.УстановитьПараметр("ИнформационнаяБаза", ИнформационнаяБаза);
	Запрос.УстановитьПараметр("ВидМетаданных", ВидМетаданных);

	РезультатЗапроса = Запрос.Выполнить();
	Выборка          = РезультатЗапроса.Выбрать();

	Результат = Новый Массив;

	Пока Выборка.Следующий() Цикл

		Элемент = Новый Структура;
		Элемент.Вставить("ИмяОбъекта", Выборка.ИмяОбъекта);
		Элемент.Вставить("Синоним",    Выборка.Синоним);
		Результат.Добавить(Элемент);

	КонецЦикла;

	Возврат Результат;

КонецФункции

// Возвращает список объектов метаданных из платформенного API текущей конфигурации.
//
// Параметры:
//  ВидМетаданных - Строка
//
// Возвращаемое значение:
//  Массив из Структура {ИмяОбъекта, Синоним}
//
Функция СписокОбъектовИзПлатформы(ВидМетаданных)

	ОписаниеВида = цур_РеестрМетаданныхСерверПовтИсп.ОписаниеВида(ВидМетаданных);
	Если ОписаниеВида = Неопределено Или ПустаяСтрока(ОписаниеВида.ИмяКоллекцииМетаданных) Тогда
		Возврат Новый Массив;
	КонецЕсли;

	КоллекцияМетаданных = Метаданные[ОписаниеВида.ИмяКоллекцииМетаданных];
	Если КоллекцияМетаданных = Неопределено Тогда
		Возврат Новый Массив;
	КонецЕсли;

	Результат = Новый Массив;

	Для Каждого ОбъектМД Из КоллекцияМетаданных Цикл

		Элемент = Новый Структура;
		Элемент.Вставить("ИмяОбъекта", ОбъектМД.Имя);
		Элемент.Вставить("Синоним",    ОбъектМД.Синоним);
		Результат.Добавить(Элемент);

	КонецЦикла;

	Возврат Результат;

КонецФункции

// Возвращает структуру объекта из регистра цур_МетаданныеКонфигурации.
//
// Параметры:
//  ИнформационнаяБаза - СправочникСсылка.цур_ИнформационныеБазы
//  ВидМетаданных      - Строка
//  ИмяОбъекта         - Строка
//
// Возвращаемое значение:
//  Структура или Неопределено
//
//BSLLS:LatinAndCyrillicSymbolInWord-off
Функция СтруктураОбъектаИзРегистра(ИнформационнаяБаза, ВидМетаданных, ИмяОбъекта)
//BSLLS:LatinAndCyrillicSymbolInWord-on

	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	Рег.ДанныеJSON КАК ДанныеJSON
	|ИЗ
	|	РегистрСведений.цур_МетаданныеКонфигурации КАК Рег
	|ГДЕ
	|	Рег.ИнформационнаяБаза = &ИнформационнаяБаза
	|	И Рег.ВидМетаданных = &ВидМетаданных
	|	И Рег.ИмяОбъекта = &ИмяОбъекта";

	Запрос.УстановитьПараметр("ИнформационнаяБаза", ИнформационнаяБаза);
	Запрос.УстановитьПараметр("ВидМетаданных", ВидМетаданных);
	Запрос.УстановитьПараметр("ИмяОбъекта", ИмяОбъекта);

	РезультатЗапроса = Запрос.Выполнить();

	Если РезультатЗапроса.Пустой() Тогда
		Возврат Неопределено;
	КонецЕсли;

	Выборка = РезультатЗапроса.Выбрать();
	Выборка.Следующий();

	Если ПустаяСтрока(Выборка.ДанныеJSON) Тогда
		Возврат Неопределено;
	КонецЕсли;

	Возврат РазобратьJSONСтруктуры(Выборка.ДанныеJSON);

КонецФункции

// Возвращает структуру объекта из платформенного API.
//
// Параметры:
//  ВидМетаданных - Строка
//  ИмяОбъекта    - Строка
//
// Возвращаемое значение:
//  Структура или Неопределено
//
//BSLLS:LatinAndCyrillicSymbolInWord-off
Функция СтруктураОбъектаИзПлатформы(ВидМетаданных, ИмяОбъекта)
//BSLLS:LatinAndCyrillicSymbolInWord-on

	ОписаниеВида = цур_РеестрМетаданныхСерверПовтИсп.ОписаниеВида(ВидМетаданных);
	Если ОписаниеВида = Неопределено Или ПустаяСтрока(ОписаниеВида.ИмяКоллекцииМетаданных) Тогда
		Возврат Неопределено;
	КонецЕсли;

	КоллекцияМетаданных = Метаданные[ОписаниеВида.ИмяКоллекцииМетаданных];
	Если КоллекцияМетаданных = Неопределено Тогда
		Возврат Неопределено;
	КонецЕсли;

	ОбъектМД = КоллекцияМетаданных.Найти(ИмяОбъекта);
	Если ОбъектМД = Неопределено Тогда
		Возврат Неопределено;
	КонецЕсли;

	//BSLLS:LatinAndCyrillicSymbolInWord-off
	Результат = Новый Структура;
	Результат.Вставить("attributes",        КоллекцияВСписок(ОбъектМД.Реквизиты));
	Результат.Вставить("tabularSections",   СобратьТабличныеЧасти(ОбъектМД));
	Результат.Вставить("standardAttributes",КоллекцияВСписок(ОбъектМД.СтандартныеРеквизиты));
	Результат.Вставить("commands",          КоллекцияКомандВСписок(ОбъектМД));
	//BSLLS:LatinAndCyrillicSymbolInWord-on

	Возврат Результат;

КонецФункции

// Формирует JSON-строку с описанием структуры объекта метаданных.
//
// Параметры:
//  ОбъектМД - ОбъектМетаданных
//
// Возвращаемое значение:
//  Строка - сериализованный JSON
//
Функция СобратьJSONОбъекта(ОбъектМД)

	//BSLLS:LatinAndCyrillicSymbolInWord-off
	Данные = Новый Структура;

	Попытка
		Данные.Вставить("attributes", КоллекцияВСписок(ОбъектМД.Реквизиты));
	Исключение
		Данные.Вставить("attributes", Новый Массив);
	КонецПопытки;

	Попытка
		Данные.Вставить("tabularSections", СобратьТабличныеЧасти(ОбъектМД));
	Исключение
		Данные.Вставить("tabularSections", Новый Массив);
	КонецПопытки;

	Попытка
		Данные.Вставить("standardAttributes", КоллекцияВСписок(ОбъектМД.СтандартныеРеквизиты));
	Исключение
		Данные.Вставить("standardAttributes", Новый Массив);
	КонецПопытки;

	Попытка
		Данные.Вставить("commands", КоллекцияКомандВСписок(ОбъектМД));
	Исключение
		Данные.Вставить("commands", Новый Массив);
	КонецПопытки;
	//BSLLS:LatinAndCyrillicSymbolInWord-on

	Возврат СериализоватьВJSON(Данные);

КонецФункции

// Преобразует коллекцию метаданных (реквизиты / стандартные реквизиты) в массив структур.
//
// Параметры:
//  Коллекция - КоллекцияОбъектовМетаданных
//
// Возвращаемое значение:
//  Массив из Структура {name, synonym}
//
//BSLLS:LatinAndCyrillicSymbolInWord-off
Функция КоллекцияВСписок(Коллекция)
//BSLLS:LatinAndCyrillicSymbolInWord-on

	Результат = Новый Массив;

	Для Каждого Элемент Из Коллекция Цикл

		//BSLLS:LatinAndCyrillicSymbolInWord-off
		Запись = Новый Структура;
		Запись.Вставить("name",    Элемент.Имя);
		Запись.Вставить("synonym", Элемент.Синоним);
		//BSLLS:LatinAndCyrillicSymbolInWord-on
		Результат.Добавить(Запись);

	КонецЦикла;

	Возврат Результат;

КонецФункции

// Собирает описание табличных частей объекта метаданных, включая их реквизиты.
//
// Параметры:
//  ОбъектМД - ОбъектМетаданных
//
// Возвращаемое значение:
//  Массив из Структура {name, synonym, attributes}
//
//BSLLS:LatinAndCyrillicSymbolInWord-off
Функция СобратьТабличныеЧасти(ОбъектМД)
//BSLLS:LatinAndCyrillicSymbolInWord-on

	Результат = Новый Массив;

	Попытка
		КоллекцияТЧ = ОбъектМД.ТабличныеЧасти;
	Исключение
		Возврат Результат;
	КонецПопытки;

	Для Каждого ТЧ Из КоллекцияТЧ Цикл

		//BSLLS:LatinAndCyrillicSymbolInWord-off
		ОписаниеТЧ = Новый Структура;
		ОписаниеТЧ.Вставить("name",       ТЧ.Имя);
		ОписаниеТЧ.Вставить("synonym",    ТЧ.Синоним);
		ОписаниеТЧ.Вставить("attributes", КоллекцияВСписок(ТЧ.Реквизиты));
		//BSLLS:LatinAndCyrillicSymbolInWord-on
		Результат.Добавить(ОписаниеТЧ);

	КонецЦикла;

	Возврат Результат;

КонецФункции

// Собирает список команд объекта метаданных (если коллекция доступна).
//
// Параметры:
//  ОбъектМД - ОбъектМетаданных
//
// Возвращаемое значение:
//  Массив из Структура {name, synonym}
//
//BSLLS:LatinAndCyrillicSymbolInWord-off
Функция КоллекцияКомандВСписок(ОбъектМД)
//BSLLS:LatinAndCyrillicSymbolInWord-on

	Попытка
		КоллекцияКоманд = ОбъектМД.Команды;
	Исключение
		Возврат Новый Массив;
	КонецПопытки;

	Возврат КоллекцияВСписок(КоллекцияКоманд);

КонецФункции

// Сериализует произвольную структуру данных в строку JSON.
//
// Параметры:
//  Данные - Произвольный
//
// Возвращаемое значение:
//  Строка
//
Функция СериализоватьВJSON(Данные)

	Запись = Новый ЗаписьJSON;
	Запись.УстановитьСтроку(Новый ПараметрыЗаписиJSON);

	ЗаписатьJSON(Запись, Данные);

	Возврат Запись.Закрыть();

КонецФункции

// Разбирает JSON-строку в структуру.
//
// Параметры:
//  СтрокаJSON - Строка
//
// Возвращаемое значение:
//  Структура или Неопределено
//
Функция РазобратьJSONСтруктуры(СтрокаJSON)

	Попытка
		Чтение = Новый ЧтениеJSON;
		Чтение.УстановитьСтроку(СтрокаJSON);
		Результат = ПрочитатьJSON(Чтение);
		Чтение.Закрыть();
		Возврат Результат;
	Исключение
		Возврат Неопределено;
	КонецПопытки;

КонецФункции

#КонецОбласти
